// 放在开始
// 1. 严谨性判断，不允许任何报错
// 2. 任何递归程序，先写出口
// 3. 任何一种算法，都没有优劣之分，只有是否适合的场景

// 根据根节点遍历树，找出最深的节点，设为主干，加标记，根据节点数排序、
const root = {
    "children": [
        {
            "B1": "B1",
            "B2": "B2",
            "children": [
                {
                    "D1": "D1",
                    "D2": "D2"
                },
                {
                    "F": "F"
                }
            ]
        },
        {
            "C1": "C1",
            "C2": "C2",
            "children": [
                {
                    "E1": "E1",
                    "E2": "E2",
                    "children": [
                        {
                            "G1": "G1",
                            "G2": "G2"
                        },
                        {
                            "H": "H"
                        }
                    ]
                }
            ]
        }
    ]
}
